app/views/messages/_message.html.erb

      <h6 class="title is-5"> <%= message.user.name || message.user.email %> </h6>
      <h7> <%= message.created_at %> </h7>
---
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["body", "Yo"], ["created_at", "2022-05-03 15:23:28.772533"], ["updated_at", "2022-05-03 15:23:28.772533"]]