app/views/toucs/_feed.html.erb

          <%= button_to 'Like', touc_likes_path(touc), method: :touc %>
          <%= touc.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."touc_id" = ?  [["touc_id", 18]]