app/views/toucs/_profile.html.erb

            <p class="heading">Toucs</p>
            <p class="title is-6"><%= current_user.toucs.count %></p>
---
SELECT COUNT(*) FROM "toucs" WHERE "toucs"."user_id" = ?  [["user_id", 2]]