app/controllers/likes_controller.rb

  def create
    if already_liked?
      flash[:notice] = "You can't like more than once"
    else
      @touc.likes.create(user_id: current_user.id)
---
INSERT INTO "likes" ("touc_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["touc_id", 18], ["user_id", 3], ["created_at", "2022-05-05 06:59:21.606340"], ["updated_at", "2022-05-05 06:59:21.606340"]]

  def find_touc
    @touc = Touc.find(params[:touc_id])
---
SELECT "toucs".* FROM "toucs" WHERE "toucs"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def already_liked?
    Like.where(user_id: current_user.id, touc_id:
      params[:touc_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."touc_id" = ? LIMIT ?  [["user_id", 3], ["touc_id", 18], ["LIMIT", 1]]