app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["body", "Yo"], ["created_at", "2022-05-03 15:23:28.772533"], ["updated_at", "2022-05-03 15:23:28.772533"]]
---
    def create
        @message = current_user.messages.create(body: msg_params[:content], room_id: params[:room_id])