app/controllers/toucs_controller.rb

SELECT "toucs".* FROM "toucs" ORDER BY created_at DESC
---
  def index
    @toucs = Touc.all.order("created_at DESC")

INSERT INTO "toucs" ("touc", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["touc", "ah oui oui oui"], ["created_at", "2022-03-24 00:51:19.553788"], ["updated_at", "2022-03-24 00:51:19.553788"], ["user_id", 2]]
---
  def create
    @touc = Touc.new(touc_params)

    respond_to do |format|
      if @touc.save

UPDATE "toucs" SET "touc" = ?, "updated_at" = ? WHERE "toucs"."id" = ?  [["touc", "Salu toa toa salu\r\n"], ["updated_at", "2022-03-22 10:15:09.607299"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @touc.update(touc_params)

DELETE FROM "toucs" WHERE "toucs"."id" = ?  [["id", 4]]
---
  def destroy
    @touc.destroy

SELECT "toucs".* FROM "toucs" WHERE "toucs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_touc
      @touc = Touc.find(params[:id])